artillery-load-test.yml
config:
  #target: 'http://localhost:8090'
  target: 'http://3.87.79.177:8090'
  http:
    # Responses have to be sent within 1 seconds or the request will be aborted
    timeout: 1
  phases:
    - duration: 30
      arrivalRate: 1000
scenarios:
  - name: "Hit /current API [functions as a peak speed control for a Spring Boot app]"
    flow:
      - get:
          url: "/current"

  - name: "Hit /next API"
    flow:
      - get:
          url: "/next"

#  - name: "Hit /previous API"
#    flow:
#      - get:
#          url: "/previous"